# Условные конструкции

## Примеры для темы с псевдокодом

# ------------ 1

"""
Домашка_есть: "Да" или "Нет"

Если Домашка_есть равен "Да",
    то у меня есть домашка на завтра и гулять не буду
Иначе,
    у меня свободный день и буду кататься на самокате
"""

# ------------ 2
"""
Бонусы: 0

Если Бонусы больше 500:
    Зайду в магазин куплю сладости
"""

# ------------ 3
"""
Погода на завтра: Дождь

Если Погода равна Ясно:
    Иду гулять
Иначе если Дождь,
    Поиграю в компьютерные игры с друзьями
Иначе, 
    Останусь дома
"""

# ------------ 4

"""
Входные данные:
А = 4
Б = 9

Если (А - Б) больше НУЛЯ,
    то, получить квадратный корень разности чисел (А - Б) и сохранить в переменную С
Иначе,
    возвести в квадрат разности чисел (А - Б) и сохранить в переменную С


Печатать значение переменной С
"""

# -----------------------------
# if -----> если
# elif -----> иначе если
# else -----> иначе
# -----------------------------

# ------------ 5

# Решение псевдокода №4 на Python

A = int(input())  # 4
B = int(input())  # 7

if (A - B) > 0:
    C = (A - B) ** 0.5
else:
    C = (A - B) ** 2

print(C)
